Tekla Open API Reference for Tekla Structures 2025
PolygonNode Constructor
 Initializes a new instance of the PolygonNode class.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolygonNode(
	Contour contour,
	bool isAutomaticNode = false
)
Public Sub New (
	contour As Contour,
	Optional isAutomaticNode As Boolean = false
)
Parameters
contour
Type: Tekla.Structures.Model.Contour
The contour points of the node.
isAutomaticNode (Optional)
Type: System.Boolean
true if the node represents an automatically generated extension.
See Also
Reference
PolygonNode Class
Tekla.Structures.Model Namespace